public/man/man1/login.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - login.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - login.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>login - begin session on the system</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>login</strong> [-p] [-h <em>host/] [/username/] [/ENV=VAR</em>…]</p>
<p>
<strong>login</strong> [-p] [-h <em>host/] -f /username</em></p>
<p>
<strong>login</strong> [-p] -r <em>host</em></p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>The <strong>login</strong> program is used to establish a new session with the system.
It is normally invoked automatically by responding to the <em>login:</em>
prompt on the users terminal. <strong>login</strong> may be special to the shell and
may not be invoked as a sub-process. When called from a shell, <strong>login</strong>
should be executed as <strong>exec login</strong> which will cause the user to exit
from the current shell (and thus will prevent the new logged in user to
return to the session of the caller). Attempting to execute <strong>login</strong> from
any shell but the login shell will produce an error message.</p>
<p>
The user is then prompted for a password, where appropriate. Echoing is
disabled to prevent revealing the password. Only a small number of
password failures are permitted before <strong>login</strong> exits and the
communications link is severed.</p>
<p>
If password aging has been enabled for your account, you may be prompted
for a new password before proceeding. You will be forced to provide your
old password and the new password before continuing. Please refer to
*passwd*(1) for more information.</p>
<p>
Your user and group ID will be set according to their values in the
/etc/passwd file. The value for <strong>$HOME</strong>, <strong>$SHELL</strong>, <strong>$PATH</strong>, <strong>$LOGNAME</strong>,
and <strong>$MAIL</strong> are set according to the appropriate fields in the password
entry. Ulimit, umask and nice values may also be set according to
entries in the GECOS field.</p>
<p>
On some installations, the environmental variable <strong>$TERM</strong> will be
initialized to the terminal type on your tty line, as specified in
/etc/ttytype.</p>
<p>
An initialization script for your command interpreter may also be
executed. Please see the appropriate manual section for more information
on this function.</p>
<p>
A subsystem login is indicated by the presence of a &#34;*&#34; as the first
character of the login shell. The given home directory will be used as
the root of a new file system which the user is actually logged into.</p>
<p>
The <strong>login</strong> program is NOT responsible for removing users from the utmp
file. It is the responsibility of <strong>getty*(8) and *init*(8) to clean up
apparent ownership of a terminal session. If you use *login</strong> from the
shell prompt without <strong>exec</strong>, the user you use will continue to appear to
be logged in even after you log out of the &#34;subsession&#34;.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>-f</strong></p>
<blockquote>
<p>Do not perform authentication, user is preauthenticated.</p>
<p>
Note: In that case, <em>username</em> is mandatory.</p>
</blockquote>
<p>
<strong>-h</strong></p>
<blockquote>
<p>Name of the remote host for this login.</p>
</blockquote>
<p>
<strong>-p</strong></p>
<blockquote>
<p>Preserve environment.</p>
</blockquote>
<p>
The <strong>-r</strong>, <strong>-h</strong> and <strong>-f</strong> options are only used when <strong>login</strong> is invoked by
root.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
CAVEATS
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>This version of <strong>login</strong> has many compilation options, only some of which
may be in use at any particular site.</p>
<p>
The location of files is subject to differences in system configuration.</p>
<p>
The <strong>login</strong> program is NOT responsible for removing users from the utmp
file. It is the responsibility of <strong>getty*(8) and *init*(8) to clean up
apparent ownership of a terminal session. If you use *login</strong> from the
shell prompt without <strong>exec</strong>, the user you use will continue to appear to
be logged in even after you log out of the &#34;subsession&#34;.</p>
<p>
As with any program, *login*s appearance can be faked. If non-trusted
users have physical access to a machine, an attacker could use this to
obtain the password of the next person coming to sit in front of the
machine. Under Linux, the SAK mechanism can be used by users to initiate
a trusted path and prevent this kind of attack.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
CONFIGURATION
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>The following configuration variables in /etc/login.defs change the
behavior of this tool:</p>
<p>
<strong>DEFAULT_HOME</strong> (boolean)</p>
<blockquote>
<p>Indicate if login is allowed if we cant cd to the home directory.
Default is no.</p>
<p>
If set to <em>yes</em>, the user will login in the root (/) directory if it is
not possible to cd to her home directory.</p>
</blockquote>
<p>
<strong>ENV_PATH</strong> (string)</p>
<blockquote>
<p>If set, it will be used to define the PATH environment variable when a
regular user login. The value is a colon separated list of paths (for
example <em>/bin:/usr/bin</em>) and can be preceded by <em>PATH=</em>. The default
value is <em>PATH=/bin:/usr/bin</em>.</p>
</blockquote>
<p>
<strong>ENV_SUPATH</strong> (string)</p>
<blockquote>
<p>If set, it will be used to define the PATH environment variable when the
superuser login. The value is a colon separated list of paths (for
example <em>/sbin:/bin:/usr/sbin:/usr/bin</em>) and can be preceded by <em>PATH=</em>.
The default value is <em>PATH=/sbin:/bin:/usr/sbin:/usr/bin</em>.</p>
</blockquote>
<p>
<strong>ERASECHAR</strong> (number)</p>
<blockquote>
<p>Terminal ERASE character (<em>010</em> = backspace, <em>0177</em> = DEL).</p>
<p>
The value can be prefixed &#34;0&#34; for an octal value, or &#34;0x&#34; for an
hexadecimal value.</p>
</blockquote>
<p>
<strong>FAIL_DELAY</strong> (number)</p>
<blockquote>
<p>Delay in seconds before being allowed another attempt after a login
failure.</p>
</blockquote>
<p>
<strong>FAKE_SHELL</strong> (string)</p>
<blockquote>
<p>If set, <strong>login</strong> will execute this shell instead of the users shell
specified in /etc/passwd.</p>
</blockquote>
<p>
<strong>HUSHLOGIN_FILE</strong> (string)</p>
<blockquote>
<p>If defined, this file can inhibit all the usual chatter during the login
sequence. If a full pathname is specified, then hushed mode will be
enabled if the users name or shell are found in the file. If not a full
pathname, then hushed mode will be enabled if the file exists in the
users home directory.</p>
</blockquote>
<p>
<strong>KILLCHAR</strong> (number)</p>
<blockquote>
<p>Terminal KILL character (<em>025</em> = CTRL/U).</p>
<p>
The value can be prefixed &#34;0&#34; for an octal value, or &#34;0x&#34; for an
hexadecimal value.</p>
</blockquote>
<p>
<strong>LOGIN_RETRIES</strong> (number)</p>
<blockquote>
<p>Maximum number of login retries in case of bad password.</p>
<p>
This will most likely be overridden by PAM, since the default pam_unix
module has its own built in of 3 retries. However, this is a safe
fallback in case you are using an authentication module that does not
enforce PAM_MAXTRIES.</p>
</blockquote>
<p>
<strong>LOGIN_TIMEOUT</strong> (number)</p>
<blockquote>
<p>Max time in seconds for login.</p>
</blockquote>
<p>
<strong>LOG_OK_LOGINS</strong> (boolean)</p>
<blockquote>
<p>Enable logging of successful logins.</p>
</blockquote>
<p>
<strong>LOG_UNKFAIL_ENAB</strong> (boolean)</p>
<blockquote>
<p>Enable display of unknown usernames when login failures are recorded.</p>
<p>
Note: logging unknown usernames may be a security issue if an user enter
her password instead of her login name.</p>
</blockquote>
<p>
<strong>TTYGROUP</strong> (string), <strong>TTYPERM</strong> (string)</p>
<blockquote>
<p>The terminal permissions: the login tty will be owned by the <strong>TTYGROUP</strong>
group, and the permissions will be set to <strong>TTYPERM</strong>.</p>
<p>
<strong>TTYGROUP</strong> can be either the name of a group or a numeric group
identifier.</p>
<p>
If TTYGROUP is not defined, then the group ownership of the terminal is
set to the users primary group. If TTYPERM is not defined, then the
permissions are set to <em>0600</em>.</p>
<p>
If you have a <strong>write</strong> program which is &#34;setgid&#34; to a special group which
owns the terminals, define TTYGROUP to the group number and TTYPERM
to 0620. Otherwise leave TTYGROUP commented out and assign TTYPERM to
either 622 or 600.</p>
</blockquote>
<p>
<strong>TTYTYPE_FILE</strong> (string)</p>
<blockquote>
<p>If defined, file which maps tty line to TERM environment parameter. Each
line of the file is in a format something like &#34;vt100 tty01&#34;.</p>
</blockquote>
<p>
<strong>USERGROUPS_ENAB</strong> (boolean)</p>
<blockquote>
<p>If set to <em>yes</em>, <strong>userdel</strong> will remove the users group if it contains no
more members, and <strong>useradd</strong> will create by default a group with the name
of the user.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
FILES
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>/var/run/utmp</p>
<blockquote>
<p>List of current login sessions.</p>
</blockquote>
<p>
/var/log/wtmp</p>
<blockquote>
<p>List of previous login sessions.</p>
</blockquote>
<p>
/etc/passwd</p>
<blockquote>
<p>User account information.</p>
</blockquote>
<p>
/etc/shadow</p>
<blockquote>
<p>Secure user account information.</p>
</blockquote>
<p>
/etc/motd</p>
<blockquote>
<p>System message of the day file.</p>
</blockquote>
<p>
/etc/nologin</p>
<blockquote>
<p>Prevent non-root users from logging in.</p>
</blockquote>
<p>
/etc/ttytype</p>
<blockquote>
<p>List of terminal types.</p>
</blockquote>
<p>
$HOME/.hushlogin</p>
<blockquote>
<p>Suppress printing of system messages.</p>
</blockquote>
<p>
/etc/login.defs</p>
<blockquote>
<p>Shadow password suite configuration.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
SEE ALSO
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>*mail*(1), *passwd*(1), *sh*(1), *su*(1), *login.defs*(5), *nologin*(5),
*passwd*(5), *securetty*(5), *getty*(8).</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
